<?php
/**
 * プロトコルUNITステータス名のENUMファイル
 * 
 * Websocket用
 */

namespace App\ProtocolUnits;


use SocketManager\Library\StatusEnum;


/**
 * プロトコルUNITステータス名定義
 * 
 * Websocket用
 */
enum ProtocolForRawSocketStressTestStatusEnum: string
{
    //--------------------------------------------------------------------------
    // 定数（共通）
    //--------------------------------------------------------------------------

    /**
     * @var string 処理開始時のステータス共通
     */
    case START = StatusEnum::START->value;


    //--------------------------------------------------------------------------
    // 定数（ProtocolQueueEnum::CONNECTキュー）
    //--------------------------------------------------------------------------

    /**
     * @var string 待機中のステータス名
     */
    case WAITING = 'waiting';


    //--------------------------------------------------------------------------
    // 定数（ProtocolQueueEnum::ALIVEキュー）
    //--------------------------------------------------------------------------

    /**
     * @var string 送信中のステータス名
     */
    case SENDING = 'sending';

    /**
     * @var string 受信中のステータス名
     */
    case RECEIVING = 'receiving';


    //--------------------------------------------------------------------------
    // メソッド
    //--------------------------------------------------------------------------

}
